Tekla.Structures.Drawing.Bolt
The Bolt class contains methods related to bolts.
A bolt is a drawing object derived from a model object.
It represents a drawing bolt that has a reference to the
actual bolt in the model database.

Tekla.Structures.Drawing.Bolt.Attributes
The attributes of the bolt.
For more information see Tekla.Structures.Drawing.Bolt.BoltAttributes.

Tekla.Structures.Drawing.Bolt.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Bolt.#ctor
Create instance of Bolt

Tekla.Structures.Drawing.Bolt.#ctor(System.Boolean)
Create instance of Bolt
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.Bolt.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.Bolt.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.Bolt.Insert
NOT IMPLEMENTED.
Returns: False.

Tekla.Structures.Drawing.Bolt.Select
Calls the system to select and retrieve the object.
Returns: True on success.

Tekla.Structures.Drawing.Bolt.CheckVisibility(System.Int32)
Gets info about lines visibility
Returns: True on success.